src/Enums/InventoryTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>InventoryTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NonInventory</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/InventoryCosting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>InventoryCosting</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WeightedAverage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CostingMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryCosting</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InventoryOrExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>COGSAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UM</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultReportUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultSaleUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPurchaseUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UnitSet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UnitSets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultLocation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PreferredVendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF4String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF5String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF4Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF5Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewObject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UPC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vendor_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>vendor_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Taxable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/zoho_productCodeMap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>zoho_productCodeMap</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>zoho_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>acs_api_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/WebServices/zoho_integration/Ext/Module.bsl
// for when a product in zoho is created and a webhook gets sent to ACS
Function zoho_product(jsonin)
	ParsedJSON = InternetConnectionClientServer.DecodeJSON(jsonin);

	//Create a product in ACS
	NewProduct = Catalogs.Products.CreateItem();
	Try
		NewProduct.Code = ParsedJSON.product_code;
	Except
		Return "Fail: No product_code";
	EndTry;
	Try
		NewProduct.Description = ParsedJSON.product_name;
	Except
		Return "Fail: No product_name";
	EndTry;
	
	//make type product and follow it up with needed product settings
	NewProduct.Type = Enums.InventoryTypes.Inventory;
	NewProduct.CostingMethod = Enums.InventoryCosting.WeightedAverage;
	NewProduct.InventoryOrExpenseAccount = Constants.InventoryAccount.Get();
	
	//Start of optional fields
	Try // check for product category
		If ParsedJSON.product_category <> "" Then
			CatQuery = new Query("SELECT
			                     |	ProductCategories.Ref
			                     |FROM
			                     |	Catalog.ProductCategories AS ProductCategories
			                     |WHERE
			                     |	ProductCategories.Description = &Description");
							   
			CatQuery.SetParameter("Description", ParsedJSON.product_category);
			CatResult = CatQuery.Execute();
			If CatResult.IsEmpty() Then
				// Category is new
				NewCategory = Catalogs.ProductCategories.CreateItem();
				NewCategory.Description = ParsedJSON.product_category;
				NewCategory.Write();
				NewProduct.Category = NewCategory.Ref;
			Else
				// category exists
				item_cat = CatResult.Unload();
				NewProduct.Category = item_cat[0].Ref;
			EndIf;
		EndIf;
	Except
	EndTry;
		
	Try // check for taxable field
		If ParsedJSON.taxable = "false" Then
			NewProduct.Taxable = False;
		Else
			NewProduct.Taxable = True;
		EndIf;
	Except
	EndTry;
	
	Try // add unit price as object.price
		If ParsedJSON.unit_price <> "0.0" Then
			NewProduct.Price = Number(ParsedJSON.unit_price);
		EndIf;
	Except
	EndTry;
	
	Try // check for unit of measure
		If ParsedJSON.usage_unit <> "" Then
			UMQuery = new Query("SELECT
			                    |	UnitSets.Ref
			                    |FROM
			                    |	Catalog.UnitSets AS UnitSets
			                    |WHERE
			                    |	UnitSets.DefaultReportUnit.Description = &Description");
							   
			UMQuery.SetParameter("Description", ParsedJSON.usage_unit);
			UMResult = UMQuery.Execute();
			If UMResult.IsEmpty() Then
				// UM is new
				NewUMset = Catalogs.UnitSets.CreateItem();
				NewUMset.Description = ParsedJSON.usage_unit;
				//newUM = Catalogs.Units.CreateItem();
				//newUM.Description = ParsedJSON.usage_unit;
				//newUM.Write();
				//NewUMset.DefaultReportUnit = newUM.Ref;	
				NewUMset.Write();
				NewProduct.UnitSet = NewUMset.Ref;
			Else
				// category exists
				item_um = UMResult.Unload();
				NewProduct.UnitSet = item_um[0].Ref;
			EndIf;
		EndIf;
	Except
	EndTry;
		
	newProduct.Write();
	
	//create a record of the acs_apicode to zoho id mapping
	newRecord = Catalogs.zoho_productCodeMap.CreateItem();
	newRecord.acs_api_code = newProduct.Ref.UUID();
	Try 
		newRecord.zoho_id = ParsedJSON.product_id;
	Except
		Return "Fail: No zoho id";
	EndTry;
	newRecord.Write();
	
	Return "Success";
		
EndFunction

// for when a product in zoho gets updated
Function zoho_product_update(jsonin)
	
	ParsedJSON = InternetConnectionClientServer.DecodeJSON(jsonin);
	
	//get item uuid to update in acs
	apiQuery = new Query("SELECT
	                     |	zoho_productCodeMap.acs_api_code
	                     |FROM
	                     |	Catalog.zoho_productCodeMap AS zoho_productCodeMap
	                     |WHERE
	                     |	zoho_productCodeMap.zoho_id = &zoho_id");
					   
	apiQuery.SetParameter("zoho_id", ParsedJSON.product_id);
	queryResult = apiQuery.Execute();
	
	If NOT queryResult.IsEmpty() Then
		queryResultobj = queryResult.Unload();
		UpdatedProduct = Catalogs.Products.GetRef(New UUID(queryResultobj[0].acs_api_code));
		UpdatedProductObj = UpdatedProduct.GetObject();
		Try  // possible might break because of uniqueness problems or no update fields passed
			Try UpdatedProductObj.Code = ParsedJSON.product_code; Except EndTry;
			Try UpdatedProductObj.Description = ParsedJSON.product_name; Except EndTry; 
		Except
			Return "Failed to update";
		EndTry;
		//Start of optional fields
		Try // check for product category
			If ParsedJSON.product_category <> "" Then
				CatQuery = new Query("SELECT
				                     |	ProductCategories.Ref
				                     |FROM
				                     |	Catalog.ProductCategories AS ProductCategories
				                     |WHERE
				                     |	ProductCategories.Description = &Description");
								   
				CatQuery.SetParameter("Description", ParsedJSON.product_category);
				CatResult = CatQuery.Execute();
				If CatResult.IsEmpty() Then
					// Category is new
					NewCategory = Catalogs.ProductCategories.CreateItem();
					NewCategory.Description = ParsedJSON.product_category;
					NewCategory.Write();
					UpdatedProductObj.Category = NewCategory.Ref;
				Else
					// category exists
					item_cat = CatResult.Unload();
					UpdatedProductObj.Category = item_cat[0].Ref;
				EndIf;
			Else
				UpdatedProductObj.Category = Catalogs.ProductCategories.EmptyRef();
			EndIf;
		Except
		EndTry;
		
		Try // check for taxable field
			If ParsedJSON.taxable = "false" Then
				UpdatedProductObj.Taxable = False;
			Else
				UpdatedProductObj.Taxable = True;
			EndIf;
		
		Except
		EndTry;
	
		Try // add unit price as object.price
			If ParsedJSON.unit_price <> "0.0" Then
				UpdatedProductObj.Price = Number(ParsedJSON.unit_price);
			EndIf;
		Except
		EndTry;
		
		Try // check for unit of measure
			If ParsedJSON.usage_unit <> "" Then
				UMQuery = new Query("SELECT
				                    |	UnitSets.Ref
				                    |FROM
				                    |	Catalog.UnitSets AS UnitSets
				                    |WHERE
				                    |	UnitSets.DefaultReportUnit.Description = &Description");
								   
				UMQuery.SetParameter("Description", ParsedJSON.usage_unit);
				UMResult = UMQuery.Execute();
				If UMResult.IsEmpty() Then
					// UM is new
					NewUMset = Catalogs.UnitSets.CreateItem();
					NewUMset.Description = ParsedJSON.usage_unit;
					newUM = Catalogs.Units.CreateItem();
					newUM.Description = ParsedJSON.usage_unit;
					newUM.Write();
					NewUMset.DefaultReportUnit = newUM.Ref;	
					NewUMset.Write();
					UpdatedProductObj.UnitSet = NewUMset.Ref;
				Else
					// um exists
					item_um = UMResult.Unload();
					UpdatedProductObj.UnitSet = item_um[0].Ref;
				EndIf;
			EndIf;
		Except
		EndTry;

	Else
		Return "couldnt find item to update.";
	EndIf;
	
	UpdatedProductObj.Write();
	Return "Success";

EndFunction
